results/M2.5_0.08715574274765817/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

/*
Inflow temperature:
300K
*/

T   300;

dimensions      [0 0 0 1 0 0 0];

internalField   uniform $T;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform $T;
    }

    sym
    {
        type            symmetry;
    }

    wedge
    {
        type            zeroGradient;//slip;
    }

    top
    {
        // freeStream to make it converge towards the stationary solution
        type            freestream;
        freestreamValue uniform $T;
    }

    back
    {
        type            empty;
    }

    front
    {
        type            empty;
    }

    outlet
    {
        // type           zeroGradient;
        type            inletOutlet;
        inletValue      uniform $T;
        value           uniform $T;
    }
}


// ************************************************************************* //
